ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p551x_gpio_data_read_regs.xml
<module id="GPIO_DATA_READ_REGS" HW_revision="" description="GPIO DATA READ Registers">
	<register id="GPADAT_R" width="32" page="1" offset="0x0" internal="0" description="GPIO A Data Read Register">
		<bitfield id="DATA" description="GPADAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPBDAT_R" width="32" page="1" offset="0x2" internal="0" description="GPIO B Data Read Register">
		<bitfield id="DATA" description="GPBDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="GPHDAT_R" width="32" page="1" offset="0xe" internal="0" description="GPIO H Data Read Register">
		<bitfield id="DATA" description="GPHDAT register value" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
